Revit 2027 API
ValueParsingOptions Properties
The ValueParsingOptions type exposes the following members.
Properties
Name | Description
AllowedValues |  The allowable range of values to be parsed.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
ValueParsingOptions Class
Autodesk.Revit.DB Namespace